In [ ]:
import pandas as pd

In [ ]:
datos_de_ventas = {
    'Vendedor' : ['Claudia', 'Gabriel', 'Maria', 'Ignacio', 'Roberto']
    , 'Dia_1' : [10,5,7,6,7]
    , 'Dia_2' : [5,8,10,9,5]
    , 'Dia_3' : [7,6,8,8,6]
}

In [ ]:
base = pd.DataFrame(datos_de_ventas)
base

  Vendedor  Dia_1  Dia_2  Dia_3
0  Claudia     10      5      7
1  Gabriel      5      8      6
2    Maria      7     10      8
3  Ignacio      6      9      8
4  Roberto      7      5      6

In [ ]:
base['Promedio'] = ((base['Dia_1']+base['Dia_2']+base['Dia_3'])/3).round(2)
base

  Vendedor  Dia_1  Dia_2  Dia_3  Promedio
0  Claudia     10      5      7      7.33
1  Gabriel      5      8      6      6.33
2    Maria      7     10      8      8.33
3  Ignacio      6      9      8      7.67
4  Roberto      7      5      6      6.00